# Importing Libraries
import os
import shutil


# Setting Paths
dir_data = './accida_segmentation_dataset_v1'
dir_data_new = './datasets'
category_damages = ['dent', 'scratch', 'spacing']
category_data = ['test', 'train', 'valid']
category_represents = ['images', 'masks']

# Defining the file list to be erased
spacing_except_data = [
        '20190818_493031566140159775.jpeg', #손잡이부분을 이격으로 라벨링함
        '20190818_492061566101029326.jpeg',	#이격있다고 판단 안됨
        '20190816_489221565923816243.jpeg',	#트렁크 사이를 이격으로 라벨링함
        '20190812_485061565574086740.jpeg',	#이격있다고 판단 안됨
        '20190808_480381565257406038.jpeg',	#이격있다고 판단 안됨
        '20190807_479491565176758472.jpeg',	#사람팔사진
        '20190805_476671564979440911.jpeg',	#이미지내 글씨있음
        '20190805_476671564979438562.jpeg',	#이미지내 글씨있음
        '20190805_476671564979437397.jpeg',	#이미지내 글씨있음
        '20190805_476671564979436008.jpeg',	#이미지내 글씨있음
        '20190805_476671564979433113.jpeg',	#이미지내 글씨있음
        '20190804_475591564899663484.jpeg',	# 차량이미지라고 보기힘듬
        '20190804_475591564899662383.jpeg',	#차량내부에서 밖을 찍음
        '20190731_470331564555126804.jpeg',	# 차량이미지 아님(영수증)
        '20190731_470331564555124879.jpeg',	# # 차량이미지 아님(영수증)
        '20190727_465621564202183181.jpeg',	# 이격이 어마어마한대 마스크가 커버 못침
        '20190723_462041563890240798.jpeg',	# 이미지에 노란색 동그라미
        '20190723_462041563890240389.jpeg',	# 이미지에 노란색 동그라미
        '20190722_460641563784863099.jpeg',	# 이격있지만 마스크 처리 안됨
        '20190717_455021563337341248.jpeg',	# 이미지내 글씨있음
        '20190717_455021563337340508.jpeg',	# 이미지내 글씨있음
        '20190717_455011563337229116.jpeg',	# 이미지내 글씨잇음
        '20190717_455011563337228528.jpeg',	# 이미지내 글씨있음
        '20190717_455011563337227919.jpeg',	# 이미지내 글씨있음
        '20190717_455011563337227221.jpeg',	# 이미지내 글씨있음
        '20190717_455011563337226280.jpeg',	# 이미지내 글씨있음
        '20190715_453281563189200301.jpeg',	# 이미지내 노란색 표시
        '20190715_453281563189199824.jpeg',	# 이미지내 노란색 표시
        '20190715_453281563189199179.jpeg',	# 이미지내 노란색 표시
        '20190624_429791561334936827.jpeg',	# 이미지내 글씨있음
        '20190624_429791561334936271.jpeg',	# 이미지내 글씨있음
        '20190624_429791561334935608.jpeg',	# 이미지내 글씨있음
        '20190624_429791561334936827.jpeg',	# 이미지내 텍스트
        '20190517_393311558019492109.jpeg',	# 이미지 너무 어두움
        '20190507_385581557220678079.jpeg',	# 나무가 메인
        '20190419_368741555663340993.jpeg',	# 인물사진이 메인
        '20190227_328701551250213107.jpeg',	# 차량사진인지 구분안감
        '20190225_327221551082752663.jpeg',	# 차량사진아님
        '20190225_327071551072569833.jpeg',	# 오토바이사진
        '20190225_327071551072569244.jpeg',	# 오토바이사진
        '20190225_327071551072566092.jpeg',	# 오토바이사진
        '20190225_327071551072565363.jpeg',	# 오토바이사진
        '20190225_327071551072564602.jpeg',	# 오토바이사진
        '20190218_322321550469489922.jpeg',	# 파일형식 이상
        '20190218_322321550469487907.jpeg',	# 파일형식 이상
        '20190105_291811546668889646.jpeg',	# 오토바이 사진
        '20190105_291811546668889263.jpeg',	# 오토바이 사진
        '20181227_285001545884663968.jpeg',	# 백미러만 따로 있는 사진
        '20181227_284831545844349746.jpeg',	# 전봇대가 메인
        '20190419_368741555663340993.jpeg', # 마스크이미지와 사이즈 안맞음
        '20190419_368741555663341306.jpeg', # 마스크이미지와 사이즈 안맞음
        '20190419_368741555663341717.jpeg', # 마스크이미지와 사이즈 안맞음(val)
    ]


# Making Directories & Saving Data
for damage in category_damages:
    for data in category_data:
        for represent in category_represents:
            if not os.path.exists(os.path.join(dir_data_new, damage, data, represent)):
                os.makedirs(os.path.join(dir_data_new, damage, data, represent))

            cnt = 0
            for file in os.listdir(os.path.join(dir_data, damage, data, represent)):
                if 'augmented' in file  or (damage == 'spacing' and file in spacing_except_data):
                    continue
                shutil.copyfile(os.path.join(dir_data, damage, data, represent, file),
                            os.path.join(dir_data_new, damage, data, represent, file))
                cnt += 1
            print('{0}_{1}_{2}: {3}'.format(damage, data, represent, cnt))
print('Copy done!')